luentoEsimerkit2015/autoVersion/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rateSmall X;


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    ffminx
    {
        type            fixedValue;
        value           nonuniform 0();
    }
    ffmaxx
    {
        type            fixedValue;
        value           nonuniform 0();
    }
    ffminy
    {
        type            fixedValue;
        value           nonuniform 0();
    }
    ffmaxy
    {
        type            fixedValue;
        value           nonuniform 0();
    }
    symmetryPlane
    {
        type            symmetry;
    }
    ffmaxz
    {
        type            fixedValue;
        value           nonuniform 0();
    }
    inletBig
    {
        type            flowRateInletVelocity;
        volumetricFlowRate constant 0.0003926991;
        value           uniform (0 0 0);
    }
    inletSmall
    {
        type            flowRateInletVelocity;
        volumetricFlowRate constant $rateSmall;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    wall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
