luentoEsimerkit2015/autoVersion/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.2.0                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object decomposeParDict;
}

    numberOfSubdomains 2;
    method hierarchical;
    hierarchicalCoeffs
    {
        n ( 2 1 1);
        delta 0.001;
        order yxz;
    }

    distributed false;
    roots
    (
    );